---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.IsATap
source: html/e5d5c164-1941-afa6-78c4-82b93d63bbdf.htm
---
# Autodesk.Revit.DB.FabricationPart.IsATap Method

Checks if it is any sort of tap.

## Syntax (C#)
```csharp
public bool IsATap()
```

## Returns
True if it is any sort of tap.